#Задача «Количество слов». Дана строка, состоящая из слов, разделенных пробелами. Определите, сколько в ней слов. Используйте для решения задачи метод count.
#s1=input().split()
#print(len(s1))

print(int(input().count(' '))+1)